Terraform plan for __staging__
<details>
  <summary>Plan: 3 to add, 3 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.broker_aws.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "8df92c68-8a49-4e90-a626-97185530c044"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-aws"
      ~ source_code_hash           = "dLgNrxlevjppM81MBd2+OPAY/3ZqcS1K/4rnc9kp4/o=" -> "bafQGpX33Ss7OapvwDvDu621bvuiNyMEUhRNs6DQ3xM="
        # (18 unchanged attributes hidden)


      ~ service_binding {
          ~ service_instance = "95ee9fd3-6b03-4da1-b8fe-86357c246144" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.broker_aws.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-aws-db"
      ~ replace_on_service_plan_change = false -> true
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed" # forces replacement
        tags                           = [
            "mysql",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "09618a24-5fdb-492c-ad91-3eff1add08ce"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ source_code_hash           = "0wt4Cit5VGBMPnBmVcrceFdYw5LoJAw9y9s/eKp/15E=" -> "tK94+/da+/fYULqmF7N/pZI9+KuwS83ZqN0R5x4H1iE="
        # (18 unchanged attributes hidden)


      ~ service_binding {
          ~ service_instance = "9e6387a2-9b29-464a-b0df-6e9e50360d1d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.broker_eks.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-eks-db"
      ~ replace_on_service_plan_change = false -> true
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed" # forces replacement
        tags                           = [
            "mysql",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "ee3956f0-aab7-476e-b556-6013cf5e164f"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solr"
        # (19 unchanged attributes hidden)


      ~ service_binding {
          ~ service_instance = "51b96118-b9b8-4e47-9b60-49ba3ac81e4f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.broker_solr.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-solr-db"
      ~ replace_on_service_plan_change = false -> true
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed" # forces replacement
        tags                           = [
            "mysql",
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.
```
</details>

Plan generated in [plan #92](https://github.com/GSA/datagov-ssb/actions/runs/872151205)